export const text1 = `
<캠퍼스택시>('http://www.campustaxi.coo.kr/'이하 'CampusTaxi')은(는) 개인정보보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.

<캠퍼스택시>('CampusTaxi') 은(는) 회사는 개인정보처리방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.

○ 본 방침은 서비스 오픈부터 시행됩니다.


1. 개인정보의 처리 목적 <캠퍼스택시>('http://www.campustaxi.coo.kr/'이하 'CampusTaxi')은(는) 개인정보를 다음의 목적을 위해 처리합니다. 처리한 개인정보는 다음의 목적이외의 용도로는 사용되지 않으며 이용 목적이 변경될 시에는 사전동의를 구할 예정입니다.

가. 홈페이지 회원가입 및 관리

회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.


나. 재화 또는 서비스 제공

서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 연령인증 등을 목적으로 개인정보를 처리합니다.


다. 마케팅 및 광고에의 활용

신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 인구통계학적 특성에 따른 서비스 제공 및 광고 게재 , 서비스의 유효성 확인, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.

2. 개인정보 파일 현황

1. 개인정보 파일명 : privacyLaw
- 개인정보 항목 : 이메일, 휴대전화번호, 자택주소, 비밀번호, 로그인ID, 성별, 이름, 학력, 신용카드정보, 은행계좌정보, 접속 로그, 쿠키, 접속 IP 정보, 결제기록
- 수집방법 : 홈페이지
- 보유근거 : 홈페이지를 통한 사용자정보 수집 및 즉각파기
- 보유기간 : 지체없이 파기
- 관련법령 : 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년, 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년, 표시/광고에 관한 기록 : 6개월

3. 개인정보의 처리 및 보유 기간

① <캠퍼스택시>('CampusTaxi')은(는) 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집시에 동의 받은 개인정보 보유,이용기간 내에서 개인정보를 처리,보유합니다.

② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.

1.<홈페이지 회원가입 및 관리>
<홈페이지 회원가입 및 관리>와 관련한 개인정보는 수집.이용에 관한 동의일로부터<3년>까지 위 이용목적을 위하여 보유.이용됩니다.
-보유근거 : 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
-관련법령 : 1)신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년
2) 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년
3) 대금결제 및 재화 등의 공급에 관한 기록 : 5년

4. 개인정보의 제3자 제공에 관한 사항

① <캠퍼스택시>('http://www.campustaxi.coo.kr/'이하 'CampusTaxi')은(는) 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.

② <캠퍼스택시>('http://www.campustaxi.coo.kr/')은(는) 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.

1. <캠퍼스택시>
- 개인정보를 제공받는 자 : 캠퍼스택시
- 제공받는 자의 개인정보 이용목적 : 이메일, 휴대전화번호, 비밀번호, 로그인ID, 이름, 학력, 접속 IP 정보, 결제기록
- 제공받는 자의 보유.이용기간: 1년

5. 개인정보처리 위탁

① <캠퍼스택시>('CampusTaxi')은(는) 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.

1. <>
- 위탁받는 자 (수탁자) : 캠퍼스 택시 고객
- 위탁하는 업무의 내용 : 식별 및 노쇼방지를 최소화 하기 위하여 처리함.
- 위탁기간 : 서비스 종료 전

② <캠퍼스택시>('http://www.campustaxi.coo.kr/'이하 'CampusTaxi')은(는) 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.

③ 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.
6. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.

① 정보주체는 캠퍼스택시에 대해 언제든지 개인정보 열람,정정,삭제,처리정지 요구 등의 권리를 행사할 수 있습니다.
② 제1항에 따른 권리 행사는캠퍼스택시에 대해 개인정보 보호법 시행령 제41조제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 캠퍼스택시은(는) 이에 대해 지체 없이 조치하겠습니다.
③ 제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.
④ 개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.
⑤ 개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.
⑥ 캠퍼스택시은(는) 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.

7. 처리하는 개인정보의 항목 작성

① <캠퍼스택시>('http://www.campustaxi.coo.kr/'이하 'CampusTaxi')은(는) 다음의 개인정보 항목을 처리하고 있습니다.

1<홈페이지 회원가입 및 관리>
- 필수항목 : 이메일, 비밀번호, 로그인ID, 성별, 이름, 학력, 은행계좌정보, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보, 결제기록

8. 개인정보의 파기<캠퍼스택시>('CampusTaxi')은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.

-파기절차
이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.

-파기기한
이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의 종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그 개인정보를 파기합니다.

-파기방법
전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.

9. 개인정보 자동 수집 장치의 설치•운영 및 거부에 관한 사항

① 캠퍼스택시 은 개별적인 맞춤서비스를 제공하기 위해 이용정보를 저장하고 수시로 불러오는 ‘쿠기(cookie)’를 사용합니다. ② 쿠키는 웹사이트를 운영하는데 이용되는 서버(http)가 이용자의 컴퓨터 브라우저에게 보내는 소량의 정보이며 이용자들의 PC 컴퓨터내의 하드디스크에 저장되기도 합니다. 가. 쿠키의 사용 목적 : 이용자가 방문한 각 서비스와 웹 사이트들에 대한 방문 및 이용형태, 인기 검색어, 보안접속 여부, 등을 파악하여 이용자에게 최적화된 정보 제공을 위해 사용됩니다. 나. 쿠키의 설치•운영 및 거부 : 웹브라우저 상단의 도구>인터넷 옵션>개인정보 메뉴의 옵션 설정을 통해 쿠키 저장을 거부 할 수 있습니다. 다. 쿠키 저장을 거부할 경우 맞춤형 서비스 이용에 어려움이 발생할 수 있습니다.


10. 개인정보 보호책임자 작성


① 캠퍼스택시(‘http://www.campustaxi.coo.kr/’이하 ‘CampusTaxi) 은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

▶ 개인정보 보호책임자
성명 :김민성
직책 :사장
직급 :사장
연락처 :01024419894, tkarnrwl7862@naver.com,
※ 개인정보 보호 담당부서로 연결됩니다.

▶ 개인정보 보호 담당부서
부서명 :캠퍼스 택시
담당자 :김민성
연락처 :01024419894, tkarnrwl7862@naver.com,

② 정보주체께서는 캠퍼스택시(‘http://www.campustaxi.coo.kr/’이하 ‘CampusTaxi) 의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. 캠퍼스택시(‘http://www.campustaxi.coo.kr/’이하 ‘CampusTaxi) 은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.

11. 개인정보 처리방침 변경

①이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.

12. 개인정보의 안전성 확보 조치 <캠퍼스택시>('CampusTaxi')은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.

1. 해킹 등에 대비한 기술적 대책
<캠퍼스택시>('CampusTaxi')은 해킹이나 컴퓨터 바이러스 등에 의한 개인정보 유출 및 훼손을 막기 위하여 보안프로그램을 설치하고 주기적인 갱신·점검을 하며 외부로부터 접근이 통제된 구역에 시스템을 설치하고 기술적/물리적으로 감시 및 차단하고 있습니다.

2. 개인정보의 암호화
이용자의 개인정보는 비밀번호는 암호화 되어 저장 및 관리되고 있어, 본인만이 알 수 있으며 중요한 데이터는 파일 및 전송 데이터를 암호화 하거나 파일 잠금 기능을 사용하는 등의 별도 보안기능을 사용하고 있습니다.

3. 접속기록의 보관 및 위변조 방지
개인정보처리시스템에 접속한 기록을 최소 6개월 이상 보관, 관리하고 있으며, 접속 기록이 위변조 및 도난, 분실되지 않도록 보안기능 사용하고 있습니다.

4. 개인정보에 대한 접근 제한
개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.
`;
export const text2 = `

제1조 (목적)

본 약관은 회원(캠퍼스 택시 서비스 이용약관에 동의한 자를 말합니다. 이하 “회원”이라고 합니다.)이 캠퍼스택시(이하 “회사”라고 합니다.)가 제공하는 위치기반서비스 (이하 “서비스”라고 합니다.)를 이용함에 있어 필요한 회사와 회원의 권리의무 및 책임사항을 규정함을 목적으로 합니다.
 
제2조 (약관의 명시, 효력 및 개정 등)

1. 본 약관은 서비스를 신청한 회원 또는 개인위치정보주체가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 이용자로 등록함으로써 효력이 발생합니다.
2. 회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시하거나 기타의 방법으로 공지합니다.
3. 회원이 온라인에서 본 약관의 "동의하기” 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 봅니다.
4. 회사는 「위치정보의 보호 및 이용 등에 관한 법률」, 「콘텐츠산업 진흥법」, 「전자상거래 등에서의 소비자보호에 관한 법률」, 「소비자 기본법」, 「약관의 규제에 관한 법률」 등 관련법령을 위배하지 않는 범위에서 본 약관을 개정할 수 있습니다.
5. 회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 7일 전부터 적용일 이후 상당한 기간 동안 공지합니다. 다만, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 서비스 홈페이지에 게시하거나 회원에게 전자적 방법(전자우편, SMS 등)으로 약관 개정 사실을 발송하여 고지합니다.
6. 회사가 전항에 따라 회원에게 공지하거나 통지하면서 공지 또는 통지ㆍ고지일로부터 개정약관 적용일자까지 거부의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도 불구하고 거부의 의사표시가 없는 경우에는 변경된 약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.
 

제3조 (약관 외 준칙)

본 약관에 규정되지 않은 사항에 대해서는 위치정보의 보호 및 이용 등에 관한 법률(이하 “위치정보법”이라고 합니다), 전기통신사업법, 정보통신망 이용촉진 및 보호 등에 관한 법률(이하 “정보통신망법”이라고 합니다), 개인정보보호법 등 관련법령 또는 회사가 정한 서비스의 운영정책 및 규칙 등(이하 “세부지침”이라고 합니다)의 규정에 따릅니다.
 

제4조 (가입자격)

서비스에 가입할 수 있는 자는 위치기반서비스를 이용할 수 있는 이동전화 단말기, 기타 서비스를 이용할 수 있는 단말기(이하 “단말기”라 합니다)의 소유자 본인입니다.

제5조 (서비스 가입)

1. 회사가 정한 본 약관에 회원이 동의하고, 회사가 승낙함으로써 서비스 가입의 효력이 발생합니다.
2. 회사는 다음 각 호의 회원 가입신청에 대해서는 이를 승낙하지 아니할 수 있습니다.
1) 회원 등록 사항을 빠뜨리거나 잘못 기재하여 신청하는 경우
2) 공공질서 또는 미풍양속을 저해하거나 저해할 목적으로 신청한 경우
3) 기타 회사가 정한 이용신청 요건이 충족되지 않았을 경우
 

제6조 (서비스의 해지)

회원이 서비스 이용을 해지하고자 할 경우 회원은 회사가 정한 소정의 절차(서비스 홈페이지 등을 통해 공지합니다)를 통해 서비스 해지를 신청할 수 있으며, 회사는 법령이 정하는 바에 따라 신속히 처리합니다.
 

제7조 (서비스의 내용)

1. 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 단, 회사의 업무 또는 기술상의 이유로 서비스가 일시 중지될 수 있으며, 운영상의 목적으로 회사가 정한 기간에도 서비스는 일시 중지될 수 있습니다. 이때 회사는 사전 또는 사후에 이를 공지합니다.
2. 회사가 제공하는 서비스는 다음과 같습니다.
1) 서비스 명 : 위치 공유 서비스
2) 서비스 내용 : 캠퍼스 택시 서비스 이용약관에 따른 기사 포함 승객의 중개를 위해 회원의 위치를 캠퍼스 택시 서비스 이용약관에 따라 회사와 이용계약을 체결한 제휴사에게 제공하는 서비스
3. 위치정보는 관련 기술의 발전에 따라 오차가 발생할 수 있습니다.
 

제8조 (서비스 이용요금)

1. 회사가 제공하는 서비스는 기본적으로 무료입니다. 단, 별도의 유료서비스의 경우 해당 서비스에 명시된 요금을 지불하여야 사용 가능하며, 서비스 이용 과정에서 데이터 통신료 등 통신비용이 발생할 수 있습니다.
2. 회사는 유료서비스 이용요금을 회사와 계약한 전자지불업체에서 정한 방법에 의하거나 회사가 정한 청구서에 합산하여 청구할 수 있습니다.
3. 유료서비스 이용을 통하여 결제된 대금에 대한 취소 및 환불은 회사의 결제 이용약관 등 관련법령에 따릅니다.
4. 회원의 개인정보도용 및 결제사기로 인한 환불요청 또는 결제자의 개인정보 요구는 법률이 정한 경우 외에는 거절될 수 있습니다.
5. 무선서비스 이용 시 발생하는 데이터 통신료는 별도이며, 회원이 가입한 각 이동통신사의 정책에 따릅니다.
6. MMS 등으로 게시물을 등록할 경우 발생하는 요금은 회원이 가입한 각 이동통신사의 정책에 따릅니다.
 

제9조 (서비스 이용의 제한 및 정지)

회사는 회원이 다음 각 호에 해당하는 경우 사전 통지 없이 회원의 서비스 이용을 제한 또는 정지하거나 이용계약을 해지할 수 있습니다.
1) 타인의 명의, 정보 등을 이용하여 서비스에 가입한 경우
2) 타인의 서비스 이용을 방해하거나 타인의 개인정보를 도용한 경우
3) 서비스를 이용하여 법령, 공공질서, 미풍양속 등에 반하는 행위를 한 경우
4) 서비스를 이용하여 회사, 또는 제3자에게 손해를 끼치는 경우
5) 서비스의 운영을 고의 또는 중과실로 방해하는 경우
 

제10조 (서비스의 변경 및 중지)

1. 회사는 다음 각 호의 경우에는 회원에게 서비스의 전부 또는 일부를 제한, 변경하거나 중지할 수 있습니다.
1) 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우
2) 정전, 서비스 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 경우
3) 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지하였을 경우
4) 서비스 제휴업체와의 계약 종료, 회사의 제반 사정 또는 법률상의 장애 등과 같은 중대 사유로 인하여 서비스를 유지할 수 없는 경우
5) 기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우
2. 제1항에 의한 서비스 중단의 경우에는 회사는 인터넷 등에 공지하거나 회원에게 통지합니다. 다만, 회사가 통제할 수 없는 사유로 인한 서비스의 중단(운영자의 고의, 과실이 없는 디스크 장애, 시스템다운 등)으로 인하여 사전 통지가 불가능한 경우에는 사후에 통지합니다. 이 경우에 회사는 서비스 변경 및 중지에 관한 책임을 지지 않습니다.
 

제11조 (서비스내용변경 통지 등)

1. 회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원의 등록된 전자우편 주소로 이메일을 통하여 서비스 내용의 변경 사항 또는 종료를 통지할 수 있습니다.
2. 전항의 경우 불특정 다수인을 상대로 통지를 함에 있어서는 서비스 홈페이지 등 기타 회사의 공지사항 페이지를 통하여 회원들에게 통지할 수 있습니다. 단, 회원 본인의 거래와 관련하여 중대한 영향을 미치는 사항은 상당한 기간 동안 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 개별통지 합니다.
 

제12조 (회원의 개인위치정보보호)

회사는 관련법령이 정하는 바에 따라서 회원의 개인위치정보를 보호하기 위하여 노력합니다.
 

제13조 (개인위치정보의 이용 또는 제공)

1. 회사는 서비스 제공을 위하여 회원의 위치정보를 이용할 수 있으며, 회원은 본 약관에 동의함으로써 이에 동의한 것으로 간주됩니다.
2. 회사는 회원이 제공한 개인위치정보를 당해 회원의 동의 없이 서비스 제공 이외의 목적으로 이용하지 아니합니다.
3. 회사는 회원이 제공한 개인위치정보를 당해 회원의 동의 없이 서비스 제공 이외의 목적을 위하여 제3자에게 제공하지 아니합니다.
4. 회사는 서비스 제공 목적을 위하여 회원의 개인위치정보를 회원이 지정하는 제3자에게 제공할 경우 매회 회원에게 제공받는 자, 제공 일시 및 제공목적을 회원이 지정한 전자우편으로 통보합니다.
5. 회사가 서비스 제공 목적을 위하여 회원의 개인위치정보를 제3자에게 제공하는 내역과 목적은 다음과 같습니다.
1) 제공 받는 자 - 제휴사의 드라이버
2) 제공목적 -  캠퍼스 택시 서비스 이용을 위해 매칭된 회원의 현재 위치 확인
6. 다만, 회사는 다음 각 호의 경우, 회원이 미리 요청한 경우에 한하여 회원이 지정한 이동전화 단말기 또는 이메일로 통보할 수 있습니다.
1) 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우
2) 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우
 

제14조 (개인위치정보 이용ㆍ제공 사실 확인 자료의 보유)

회사는 위치정보법 제16조 제2항에 근거하여 다른 사업자 또는 이용 회원과의 요금정산 및 민원처리를 위해 위치정보 수집, 이용, 제공사실 확인자료를 기록시점으로부터 6개월간 보존합니다.
회사는 위치정보법 제24조 제4항의 규정에 의하여 회원이 동의의 전부 또는 일부를 철회한 경우에는 지체 없이 수집된 개인위치정보 및 위치정보 이용ㆍ제공사실 확인자료(동의의 일부를 철회하는 경우에는 철회하는 부분의 개인위치정보 및 위치정보 이용ㆍ제공사실 확인자료에 한합니다)를 파기합니다. 다만, 국세기본법, 법인세법, 부가가치세법 기타 관계법령의 규정에 의하여 보존할 필요성이 있는 경우에는 관계법령에 따라 보존합니다.
 

제15조 (개인위치정보의 보유기간 및 이용기간)

회사는 회원의 개인위치정보를 이용한 경우 위치정보법 제16조 제2항의 규정에 의하여 기록 보존하여야 하는 위치정보이용 제공사실 확인자료 외의 당해 개인위치정보를 위치정보법 제23조에 따라 개인위치정보의 수집, 이용 또는 제공목적을 달성한 때 즉시 파기합니다.
 

제16조 (회사의 의무)

회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 신속하게 처리하여야 하며, 신속한 처리가 곤란한 경우 그 사유와 처리 일정을 회원에게 통지합니다.
회사는 「위치정보의 보호 및 이용 등에 관한 법률」, 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「통신비밀보호법」, 「전기통신사업법」, 「개인정보 보호법」 등 서비스의 운영, 유지와 관련 있는 법령을 준수합니다.
회사는 회원서비스를 보다 활성화하여 최적화된 서비스를 제공하고, 신상품이나 이벤트 정보안내, 설문조사 등 회원 지향적인 마케팅을 수행하기 위해 이용계약 체결 시 수집한 회원의 개인정보 및 서비스 이용과 관련한 정보를 활용할 수 있습니다. 단, 회원의 동의 범위를 초과하여 이용하거나 제3자에게 제공하고자 하는 경우에는 미리 당해 회원에게 동의를 받아야 합니다. 이 경우 회원은 회사의 동의 요청을 거절할 수 있습니다.
회사는 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원에게 제공받는 자, 제공일시 및 제공목적을 즉시 통보합니다. 단, 아래 각 호의 1에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소로 통보합니다.
1) 개인위치정보를 수집한 당해 통신단말장치가 문자, 음성 또는 영상의 수신기능을 갖추지 아니한 경우
2) 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우
 

제17조 (회원의 권리)

회원은 유무선인터넷 등을 통해 회사의 회원 개인위치정보의 이용 및 제공에 대한 동의의 전부 또는 일부에 대하여 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공사실 확인 자료를 파기합니다.
회원은 유무선인터넷 등을 통해 회사의 회원 개인위치정보의 이용 및 제공의 일시적인 중지를 요구할 수 있습니다.
회원은 회사에 대하여 다음 각 호의 1의 자료 등의 열람 또는 고지 또는 오류정정을 요구할 수 있습니다.
1) 회원에 대한 위치정보 수집, 이용, 제공사실 확인자료
2) 회원의 개인위치정보가 위치정보법 또는 다른 법률의 규정에 의하여 제3자에게 제공된 이유 및 내용
 

제18조 (회원의 의무)

회원은 서비스이용계약에 따라 요금을 지정된 기일까지 납입하여야 하며, 회사에 알린 요금 청구 주소 및 연락처가 변경된 경우에는 이를 회사에 알려야 합니다.
회원은 서비스 이용을 위해 필요한 제반 정보를 제공, 등록할 경우 현재의 사실과 일치하는 완전한 정보를 제공, 등록하여야 하며, 변경사항이 발생할 경우 즉시 갱신하여야 합니다.
회원은 단말기가 정상 동작을 유지하도록 관리하여야 하며, 단말기의 정상동작이 유지되지 않아 서비스 제공에 지장이 있을 때에는 해당 단말기의 보수, 교환 등의 처리를 신속히 행하여 원활한 서비스가 이루어지도록 합니다.
회원은 서비스 이용 시 다음 각 호의 1에 해당하는 행위를 하여서는 아니 됩니다.
1) 가입신청 또는 변경 시 허위 사실을 기재하는 행위
2) 타인의 명예를 손상시키거나 불이익을 주는 행위
3) 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형, 음성 등을 타인에게 유포하는 행위
4) 서비스와 관련된 설비의 오동작이나 정보 등의 파괴 및 혼란을 유발시키는 컴퓨터 바이러스 감염 자료를 등록 또는 유포하는 행위
5) 타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
6) 자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할 목적으로 허위의 정보를 유통시키는 행위
7) 서비스의 이용과 관련하여 취득한 타인의 개인위치정보를 무단으로 유용 또는 유출하는 행위
8) 기타 불법적이거나 부당한 행위
회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한 주의사항, 회사가 통지하는 사항 등을 준수하여야 하며, 기타 회사의 업무에 방해되는 행위를 하여서는 아니 됩니다.


제19조 (회사의 주소 및 연락처 등)

1. 회사의 상호, 주소 및 연락처는 아래와 같습니다.
1) 상호 : 캠퍼스 택시
2) 대표 : 김민성
3) 주소 : 서울특별시 강북구 덕릉로 51길 51, 4층 401호(번동)
4) 전화 : 010-2441-9894
2. 회사는 개인위치정보를 적절히 관리·보호하고, 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보관리책임자로 지정해 운영하고 있으며, 위치정보관리책임자의 성명과 연락처는 아래와 같습니다.
1) 위치정보 관리책임자 : 김민성
2) 대표전화 : 010-2441-9894
3) 주소 : 서울특별시 강북구 덕릉로 51길 51, 4층 401호(번동)
4) 이메일주소 : campustaxi@naver.com

제20조 (양도금지)

회원 및 회사는 회원의 서비스 가입에 따른 본 약관 상의 지위 또는 권리, 의무의 전부 또는 일부를 제3자에게 양도, 위임하거나 담보제공 등의 목적으로 처분할 수 없습니다.
 

제21조 (손해배상)

회원의 고의나 과실에 의해 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게 되는 경우, 본 약관을 위반한 회원은 회사에 발생하는 모든 손해를 배상하여야 합니다.
회원이 서비스를 이용함에 있어 행한 불법행위나 회원의 고의나 과실에 의해 이 약관 위반행위로 인하여 회사가 당해 회원 이외의 제3자로부터 손해배상청구 또는 소송을 비롯한 각종 이의제기를 받는 경우 당해 회원은 그로 인하여 회사에 발생한 손해를 배상하여야 합니다.
회사가 위치정보법 제15조 내지 제26조의 규정을 위반한 행위 혹은 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우, 회사가 고의 또는 과실 없음을 입증하지 아니하면, 회원의 손해에 대하여 책임을 부담합니다.
 
`;
export const text3 = `
<캠퍼스 택시 이용규칙>

커뮤니티 이용규칙
1. 커뮤니티를 이용하기 전 커뮤니티 이용규칙의 모든 내용을 반드시 숙지해주시기 바랍니다.
2. 이 약관의 정의는 서비스 이용약관을 따릅니다.

정지 처리 시스템
1. 모든 커뮤니티는 이용자의 정지를 기반으로 하는 정지처리 시스템을 통해 처리됩니다. 커뮤니티 이용규칙에 어긋난다고 판단되는 글, 방을 발견하셨을 경우, 문의 버튼을 눌러 문의해주시기 바랍니다.
2. 커뮤니티 이용규칙에 어긋나거나, 다른 이용자에게 불편을 주는 채팅을 작성해서는 안됩니다. 
3. 경고 누적으로 발생한 피해는 어떠한 경우에도 책임을 지지 않습니다.
4. 경고가 누적되었거나 커뮤니티 이용규칙을 위반한 이용자는 1일부터 영구정지까지의 방 만들기 부터 전체 서비스 접근 제한 등의 제제가 가해질 수 있습니다.
5. 모든 처리는 문의를 통하므로, 문의자 및 정지 사유를 확인하거나 접근 제한을 해제하는 것은 불가능합니다.
6. 문의 시, 처리를 위해 커뮤니티 대화의 일부가 일시적으로 저장될 수 있습니다.

유출방지 시스템
1. 커뮤니티 이용 시, 방 목록을 복사, 스크린 샷 등을 통해 외부로 유출해서는 안 됩니다. 방 목록 유출 피해를 방지하기 위해, 유출방지 시스템이 실시간으로 동작하여 방 목록 유출을 감지하고 있습니다.
2. 유출방지 시스템을 통해 방 목록 유출이 적발될 경우, 정지 전체 서비스 접근 제한이 가해집니다. 만약 방 목록 유출을 발견하셨을 경우, 문의하기를 통해 신고해주시기 바랍니다.
3. 이용자는 방 목록 유출 행위로 인해 발생한 모든 피해에 대한 민형사상 책임과 손해를 배상할 책임이 있습니다.

금지행위
다음 목록에 해당하는 채팅 행위를 금지하고 있습니다.
1. 예의범절에 어긋나는 행위
● 타인 또는 특정단체&지역에 대한 욕설, 악담, 비방, 비하, 비아냥
● 내용&결말을 발설하거나, 혐오를 불러일으키거나, 속이거나, 놀라게 하는 행위
● 과도한 정치&종교 연관 행위

2. 미풍양속에 어긋나는 행위
● 외설, 음란물, 음담패설, 신체사진 등 청소년 유해매체물 게시
● 불건전한 모임, 대화, 통화등의 만남

3. 기업, 비영리기관, 개인, 단체의 직간접적 광고, 홍보, 판매 행위
● 계정 공유 요청, 홍보 요청, 바이럴 이벤트 등 게시물 대리 작성 행위
● 공모전, 대외활동, 이벤트, 아카데미, 채용, 행사, 강연, 공연, 영화 홍보
● 교육, 의료, 식당, 부동산, 배달, 공유 사업 홍보
● 어플리케이션, 웹 사이트, 블로그, 카페, 서비스 홍보
● 구독, 좋아요, 학우 참여, 링크 클릭, 추천인 입력, 앱 설치, 회원가입 요청
● 공동구매, 펀딩, 기부금품 요청 행위
● 기타 광고, 홍보, 판매 관련 게시물 일체

4. 비정상적 서비스 이용 행위
● 특정 주체의 도배글, 내용 없는 글 등 비정상적인 방 생성 행위
● 여론 조작 행위
● 오류를 발생시키는 특수문자 작성 행위
● 허위 문의, 다중 계정 및 단체의 일괄 문의 등 문의 시스템 악용 행위
● 셔틀버스 시간 허위등 서비스 내 비정상적 정보 기재 행위

5. 불법행위
● 초상권, 저작권 침해 등 타인의 권리를 침해하는 행위
● 커뮤니티 유출, 시스템 해킹 등 커뮤니티에 악영향을 주는 행위
● 운영자 또는 이에 준하는 자격을 사칭하여 권한을 행사하는 행위
● 암표 등 수익 목적의 재판매 행위
● 기타 관련 법률에 위배되는 행위

6. 방 만들기에 명시되어있는 컨텐츠에 어긋나는 컨텐츠를 이용한 행위

7. 기타 위 목록의 행위와 동일하거나 비슷한 목적을 달성하기 위한 행위 일체

커뮤니티 방 내에서의 제도
1. 방장은 택시를 호출함.
2. 방에 문제 생기면 문의하기.
3. 택시 동승 중에 남들에게 피해갈 만한 행동금지
4. 방장은 택시 요금을 혼자 부담하며, 나머지 동승자로부터 돈을 받는 구조.
`;
export const text4 = `
마케팅 정보 수신동의
개인정보보호법 제22조 제4항에 의해 선택정보 사항에 대해서는 기재하지 않으셔도 서비스를 이용하실 수 있습니다.

① 마케팅 및 광고에의 활용
– 신규 기능 개발 및 맞춤 서비스 제공
– 뉴스레터 발송, 새로운 기능(제품)의 안내
– 할인 및 쿠폰 등 이벤트 등 광고성 정보 제공

② 캠퍼스택시 서비스를 운용함에 있어 각종 정보를 서비스 화면, SMS, 이메일 등의 방법으로 회원에게 제공할 수 있으며, 결제안내 등 의무적으로 안내되어야 하는 정보성 내용 및 일부 혜택성 정보는 수신동의 여부와 무관하게 제공합니다.

`;

