import styled from '@emotion/native';
import React from 'react';
import { Text } from 'react-native';
import { ScrollView } from 'react-native-gesture-handler';
const Cotent = styled.Text`
  padding:30px;
`
export const TermsScreen: React.FC = () => {
  return (
    <Container>
      <ScrollView>
        <Cotent>{`<캠퍼스 택시 이용규칙>

채팅방 이용규칙
1. 채팅방을 이용하기 전 커뮤니티 이용규칙의 모든 내용을 반드시 숙지해주시기 바랍니다.
2. 이 약관의 정의는 서비스 이용약관을 따릅니다.

정지 처리 시스템
1. 모든 채팅방은 이용자의 정지를 기반으로 하는 정지처리 시스템을 통해 처리됩니다. 채팅방 이용규칙에 어긋난다고 판단되는 글, 방을 발견하셨을 경우, 문의 버튼을 눌러 문의해주시기 바랍니다.
2. 채팅방 이용규칙에 어긋나거나, 다른 이용자에게 불편을 주는 채팅을 작성해서는 안됩니다. 
3. 경고 누적으로 발생한 피해는 어떠한 경우에도 책임을 지지 않습니다.
4. 경고가 누적되었거나 커뮤니티 이용규칙을 위반한 이용자는 1일부터 영구정지까지의 방 만들기 부터 전체 서비스 접근 제한 등의 제제가 가해질 수 있습니다.
5. 모든 처리는 문의를 통하므로, 문의자 및 정지 사유를 확인하거나 접근 제한을 해제하는 것은 불가능합니다.
6. 문의 시, 처리를 위해 채팅방 대화의 일부가 일시적으로 저장될 수 있습니다.

유출방지 시스템
1. 채팅방 이용 시, 방 목록을 복사, 스크린 샷 등을 통해 외부로 유출해서는 안 됩니다. 방 목록 유출 피해를 방지하기 위해, 유출방지 시스템이 실시간으로 동작하여 방 목록 유출을 감지하고 있습니다.
2. 유출방지 시스템을 통해 방 목록 유출이 적발될 경우, 정지 전체 서비스 접근 제한이 가해집니다. 만약 방 목록 유출을 발견하셨을 경우, 문의하기를 통해 신고해주시기 바랍니다.
3. 이용자는 방 목록 유출 행위로 인해 발생한 모든 피해에 대한 민형사상 책임과 손해를 배상할 책임이 있습니다.

금지행위
다음 목록에 해당하는 채팅 행위를 금지하고 있습니다.
1. 예의범절에 어긋나는 행위
● 타인 또는 특정단체&지역에 대한 욕설, 악담, 비방, 비하, 비아냥
● 내용&결말을 발설하거나, 혐오를 불러일으키거나, 속이거나, 놀라게 하는 행위
● 과도한 정치&종교 연관 행위

2. 미풍양속에 어긋나는 행위
● 외설, 음란물, 음담패설, 신체사진 등 청소년 유해매체물 게시
● 불건전한 모임, 대화, 통화등의 만남

3. 기업, 비영리기관, 개인, 단체의 직간접적 광고, 홍보, 판매 행위
● 계정 공유 요청, 홍보 요청, 바이럴 이벤트 등 게시물 대리 작성 행위
● 공모전, 대외활동, 이벤트, 아카데미, 채용, 행사, 강연, 공연, 영화 홍보
● 교육, 의료, 식당, 부동산, 배달, 공유 사업 홍보
● 어플리케이션, 웹 사이트, 블로그, 카페, 서비스 홍보
● 구독, 좋아요, 학우 참여, 링크 클릭, 추천인 입력, 앱 설치, 회원가입 요청
● 공동구매, 펀딩, 기부금품 요청 행위
● 기타 광고, 홍보, 판매 관련 게시물 일체

4. 비정상적 서비스 이용 행위
● 특정 주체의 도배글, 내용 없는 글 등 비정상적인 방 생성 행위
● 여론 조작 행위
● 오류를 발생시키는 특수문자 작성 행위
● 허위 문의, 다중 계정 및 단체의 일괄 문의 등 문의 시스템 악용 행위
● 셔틀버스 시간 허위등 서비스 내 비정상적 정보 기재 행위

5. 불법행위
● 초상권, 저작권 침해 등 타인의 권리를 침해하는 행위
● 채팅방 유출, 시스템 해킹 등 커뮤니티에 악영향을 주는 행위
● 운영자 또는 이에 준하는 자격을 사칭하여 권한을 행사하는 행위
● 암표 등 수익 목적의 재판매 행위
● 기타 관련 법률에 위배되는 행위

6. 방 만들기에 명시되어있는 컨텐츠에 어긋나는 컨텐츠를 이용한 행위

7. 기타 위 목록의 행위와 동일하거나 비슷한 목적을 달성하기 위한 행위 일체

채팅방 내에서의 제도
1. 방장은 택시를 호출함.
2. 방에 문제 생기면 문의하기.
3. 택시 동승 중에 남들에게 피해갈 만한 행동금지
4. 방장은 택시 요금을 혼자 부담하며, 나머지 동승자로부터 돈을 받는 구조. `}</Cotent>
      </ScrollView>
    </Container>
  );
};

const Container = styled.SafeAreaView``;
