import React from "react";
import Svg, { Path, Circle, G, Defs, Text, Ellipse, Rect, LinearGradient, Stop } from 'react-native-svg';

export function AdProfile() {
  return (
    <Svg
      xmlns="http://www.w3.org/2000/svg"
      width="55"
      height="55"
      viewBox="0 0 55 55"
    >
      <G data-name="그룹 720" transform="translate(-63.5 -350.779)">
        <Circle
          cx="27.5"
          cy="27.5"
          r="27.5"
          fill="#eee"
          data-name="타원 2"
          transform="translate(63.5 350.779)"
        ></Circle>
        <Circle
          cx="12"
          cy="12"
          r="12"
          fill="#99b9ec"
          data-name="타원 113"
          transform="translate(87 375)"
        ></Circle>
        <G data-name="그룹 482" transform="translate(-423.283 132.829)">
          <Path
            fill="#fff"
            d="M523.038 254.79v.99a.616.616 0 01-.427.6 1.072 1.072 0 01-.86 0 .616.616 0 01-.433-.6v-.98a2.166 2.166 0 01.259-1.126 4.576 4.576 0 01.841-.965 4.617 4.617 0 00.643-.717 1.224 1.224 0 00.21-.705.81.81 0 00-.26-.631.933.933 0 00-.68-.222q-1.064.049-1.1 1.274a.57.57 0 01-.285.464 1.136 1.136 0 01-.594.191.955.955 0 01-.588-.167.577.577 0 01-.253-.538 2.67 2.67 0 01.773-1.886 2.815 2.815 0 012.01-.8 2.861 2.861 0 012.01.6 2.081 2.081 0 01.749 1.663 2.677 2.677 0 01-.223 1.089 2.982 2.982 0 01-.458.773 6.392 6.392 0 01-.606.588l-.216.192q-.106.093-.2.192a1.42 1.42 0 00-.16.2 1.025 1.025 0 00-.112.235.866.866 0 00-.04.286zm-1.627 4.268a1.078 1.078 0 111.849-.754 1.027 1.027 0 01-.309.754 1.113 1.113 0 01-1.54 0z"
            data-name="패스 539"
          ></Path>
        </G>
        <Circle
          cx="10"
          cy="10"
          r="10"
          fill="rgba(153,185,236,0.58)"
          data-name="타원 113"
          transform="translate(69 361)"
        ></Circle>
        <Path
          fill="#fff"
          d="M368.476 309v-.557a5.288 5.288 0 015.288-5.288h1.113a5.288 5.288 0 015.288 5.288V309a9.743 9.743 0 01-11.689 0z"
          data-name="교차 5"
          transform="translate(-295.32 70.057)"
        ></Path>
        <Circle
          cx="3"
          cy="3"
          r="3"
          fill="#fff"
          data-name="타원 114"
          transform="translate(76 366)"
        ></Circle>
        <Path
          fill="#999"
          d="M433.613 315.433l-1.387.431c-.915-1.708-4.137-6.107-11.977-2.935a.438.438 0 00.147.845 8.97 8.97 0 016.916 3.617l-1.208.375a.832.832 0 00-.318 1.406l5.775 5.337a.832.832 0 001.377-.428l1.735-7.67a.832.832 0 00-1.06-.978z"
          data-name="패스 538"
          transform="translate(-336.833 59.191)"
        ></Path>
      </G>
    </Svg>
  );
}